---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.FailedToTransformAttachedGroup
source: html/48dae4f7-5991-e78e-6142-cb586eaa7c10.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.FailedToTransformAttachedGroup Property

Attached group could not be properly relocated.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToTransformAttachedGroup { get; }
```